Books_And_Tutorials/DotNet/string/string_csharp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>String in C# </title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-25 01:11:03 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">String in C# </h1>


<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="org-style.css" type="text/css" />
<style type="text/css"/><!--
  pre.display { font-family:inherit }
  pre.format  { font-family:inherit }
  pre.smalldisplay { font-family:inherit; font-size:smaller }
  pre.smallformat  { font-family:inherit; font-size:smaller }
  pre.smallexample { font-size:smaller }
  pre.smalllisp    { font-size:smaller }
  span.sc    { font-variant:small-caps }
  span.roman { font-family:serif; font-weight:normal; } 
  span.sansserif { font-family:sans-serif; font-weight:normal; } 
--></style>
<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 24-12-2013</p>
</div>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 String is a Class then why can't you create a object for the string like this String str = new String(); </a>
<ul>
<li><a href="#sec-1_1">1.1 Strings </a>
<ul>
<li><a href="#sec-1_1_1">1.1.1 Regular and Verbatim String Literals. </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> String is a Class then why can't you create a object for the string like this String str = new String(); </h2>
<div class="outline-text-2" id="text-1">


<p>
<b>Constructing Strings</b>
</p>
<p>
Many programming languages (including C#) consider String to be a
primitive type葉hat is, the compiler lets you express literal
strings directly in your source code. The compiler places these
literal strings in the module痴 metadata, and they are then loaded
and referenced at runtime.
</p>
<p>
In C#, you can稚 use the new operator to construct a String object from a literal string:
</p>


<pre class="example">using System;
public static class Program {
    public static void Main() {
        String s = new String("Hi there."); // &lt;-- Error
        Console.WriteLine(s);
    }
}
</pre>



<p>
Instead, you must use the following simplified syntax:
</p>



<pre class="example">using System;
public static class Program {
    public static void Main() {
        String s = "Hi there.";
        Console.WriteLine(s);
    }
}
</pre>



<p>
If you compile this code and examine its IL (using ILDasm.exe), you壇 see the following:
</p>



<pre class="example">.method public hidebysig static void Main() cil managed
{
.entrypoint
// Code size 13 (0xd)
.maxstack 1
.locals init (string V_0)
IL_0000: ldstr "Hi there."
IL_0005: stloc.0
IL_0006: ldloc.0
IL_0007: call void [mscorlib]System.Console::WriteLine(string)
IL_000c: ret
} // end of method Program::Main
</pre>



<p>
The newobj IL instruction constructs a new instance of an object. However, no newobj
instruction appears in the IL code example. Instead, you see the special ldstr (load string) IL
instruction, which constructs a String object by using a literal string obtained from metadata.
This shows you that the common language runtime (CLR) does, in fact, have a special way of
constructing literal String objects.
</p>

</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Strings </h3>
<div class="outline-text-3" id="text-1_1">

<p>There is no null-terminating character at the end of a C# string; therefore a C# string can contain any number of embedded null characters ('\0'). &lt;br&gt;
It is Immutable
</p>
</div>

<div id="outline-container-1_1_1" class="outline-4">
<h4 id="sec-1_1_1"><span class="section-number-4">1.1.1</span> Regular and Verbatim String Literals. </h4>
<div class="outline-text-4" id="text-1_1_1">

<p>Use **regular string** literals when you must embed escape characters provided by C#, as shown in the following example: ::
</p>


<pre class="example">string columns = "Column 1\tColumn 2\tColumn 3";
//Output: Column 1        Column 2        Column 3

string rows = "Row 1\r\nRow 2\r\nRow 3";
/* Output:
 Row 1
 Row 2
 Row 3
*/

string title = "\"The \u00C6olean Harp\", by Samuel Taylor Coleridge";
//Output: "The Æolean Harp", by Samuel Taylor Coleridge
</pre>



<p>
Use <b>verbatim strings</b> for convenience and <b>better readability</b> when the string text contains backslash characters, for example in file paths. Because verbatim strings **preserve new line characters** as part  of t he string text, they can be used to **initialize multiline strings**. Use **double quotation marks to embed a quotation mark** inside a verbatim string. The following example shows some common uses for verbatim strings: ::
</p>


<pre class="example"> string filePath = @"C:\Users\scoleridge\Documents\";
//Output: C:\Users\scoleridge\Documents\

string text = @"My pensive SARA ! thy soft cheek reclined
    Thus on mine arm, most soothing sweet it is
    To sit beside our Cot,...";
/* Output:
My pensive SARA ! thy soft cheek reclined
   Thus on mine arm, most soothing sweet it is
   To sit beside our Cot,... 
*/

string quote = @"Her name was ""Sara.""";
//Output: Her name was "Sara."
</pre>


</div>
</div>
</div>
</div>
<div id="postamble">
<p class="date"> Date: 2013-12-25 01:11:03 </p>
</div>
</div>
</body>
</html>
